[
    {
      "title": "Marketing Seminar",
      "hostedBy": "Marketing Experts",
      "imgURL": "https://media.istockphoto.com/id/667435214/photo/business-corporate-people-working-concept.webp?a=1&b=1&s=612x612&w=0&k=20&c=3sYFbaHIWBcyAvamX1TbEJOSBTuCOEk-MI-3ZnV7dnI=",
      "eventDes": "Marketing is an ever-evolving field, and staying up-to-date is crucial for success in this competitive landscape. This Marketing Seminar, hosted by Marketing Experts, brings together industry leaders and professionals to share insights, strategies, and tools to help you excel in the world of digital marketing. The event will feature keynote presentations, panel discussions, and interactive Q&A sessions focusing on the latest trends, including social media marketing, SEO optimization, and data-driven decision-making. Attendees will gain valuable knowledge on building effective campaigns, enhancing audience engagement, and leveraging analytics to measure performance. The seminar also provides excellent networking opportunities, allowing you to connect with like-minded individuals and industry leaders. Whether you're a seasoned marketing professional or just starting your journey, this seminar is designed to equip you with actionable insights and practical strategies. Join us for an engaging experience that will empower you to take your marketing skills to the next level.",
      "dressCode": "Smart casual",
      "ageRestrictions": "18 and above",
      "tags": ["marketing", "digital"],
    "startDateAndTime": "Thu Aug 28 2025 at 10:00:00 AM",
    "endDateAndTime": "Thu Aug 28 2025 at 12:00:00 PM",
      "entryPrice": 3000,
      "speakers": ["676bee37847e9c5816af0458", "676bea87d081f25b400986ef"],
      "type":"Both",
      "address": "123 Main Street, Apt 4B, New York, NY, 10001, USA"
    },
    {
      "title": "Tech Innovations Expo",
      "hostedBy": "Future Tech",
      "imgURL": "https://images.pexels.com/photos/3183183/pexels-photo-3183183.jpeg?auto=compress&cs=tinysrgb&w=400",
      "eventDes": "The Tech Innovations Expo is the ultimate destination for technology enthusiasts, professionals, and innovators. This one-day event brings together the brightest minds in the tech industry to showcase groundbreaking innovations, cutting-edge products, and emerging trends shaping the future. Attendees can explore interactive exhibits, attend insightful talks by industry experts, and participate in hands-on workshops that cover a wide range of topics, including AI, robotics, blockchain, and sustainable tech. The event is designed to foster collaboration, spark inspiration, and provide a platform for startups and established companies to present their solutions. Whether you're a developer, entrepreneur, or simply curious about technology's impact on society, the Tech Innovations Expo offers a unique opportunity to immerse yourself in the world of innovation. With networking opportunities, product launches, and exclusive demos, this expo is a must-attend for anyone passionate about technology.",
      "dressCode": "Business casual",
      "ageRestrictions": "All ages",
      "tags": ["technology", "innovation"],
    "startDateAndTime": "Sat Sep 27 2025 at 10:00:00 AM",
    "endDateAndTime": "Sat Sep 27 2025 at 12:00:00 PM",
      "entryPrice": 1500,
      "speakers": ["676bef35847e9c5816af045e", "676be758d081f25b400986eb"],
      "type":"Online",
       "address": "456 Elm Street, Los Angeles, CA, 90001, USA"
    },
    {
      "title": "Health and Wellness Workshop",
      "hostedBy": "Healthy Living",
      "imgURL": "https://images.pexels.com/photos/29881478/pexels-photo-29881478/free-photo-of-woman-running-by-lake-on-overcast-day.jpeg?auto=compress&cs=tinysrgb&w=400",
      "eventDes": "In today's fast-paced world, health and wellness have become more important than ever. The Health and Wellness Workshop is designed to provide attendees with practical tools and strategies to lead a balanced and healthy lifestyle. This workshop features expert speakers, including nutritionists, fitness trainers, and mental health professionals, who will share their expertise on topics such as meal planning, stress management, and exercise routines. The event will also include interactive sessions, such as yoga classes, mindfulness practices, and cooking demonstrations, allowing participants to experience hands-on learning. Whether you're looking to improve your physical health, boost your mental well-being, or simply learn new ways to prioritize self-care, this workshop has something for everyone. Join us for a day dedicated to enhancing your quality of life and gaining the knowledge you need to make informed choices for your health and wellness journey.",
      "dressCode": "Comfortable",
      "ageRestrictions": "15 and above",
      "tags": ["health", "wellness"],
  "startDateAndTime": "Mon Oct 27 2025 at 10:00:00 AM",
    "endDateAndTime": "Mon Oct 27 2025 at 12:00:00 PM",
      "entryPrice": 500,
      "speakers": ["676bee5f847e9c5816af045a", "676bef79847e9c5816af0460"],
      "type":"Offline",
      "address": "321 Pine Street, Floor 2, San Francisco, CA, 94101, USA"
    },
    {
      "title": "Art and Culture Festival",
      "hostedBy": "Cultural Insights",
      "imgURL": "https://images.pexels.com/photos/161101/venice-church-gondola-italy-161101.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "eventDes": "The Art and Culture Festival is a celebration of creativity and diversity, bringing together artists, performers, and cultural enthusiasts from around the world. This vibrant event features art exhibits, live performances, and interactive workshops that highlight various art forms, including painting, sculpture, dance, and music. Visitors will have the opportunity to immerse themselves in different cultures, explore traditional crafts, and witness the rich heritage of diverse communities. The festival also includes a marketplace where attendees can purchase unique handcrafted items and support local artisans. Whether you're an art lover, a culture enthusiast, or simply looking for a fun and educational experience, the Art and Culture Festival offers something for everyone. Join us for a day of inspiration, connection, and celebration as we explore the beauty of art and culture in all its forms.",
      "dressCode": "Traditional",
      "ageRestrictions": "All ages",
      "tags": ["art", "culture"],
    "startDateAndTime": "Thu Aug 28 2025 at 10:00:00 AM",
    "endDateAndTime": "Thu Aug 28 2025 at 12:00:00 PM",
      "entryPrice": 800,
      "speakers": ["676bef79847e9c5816af0460"],
      "type":"Both",
      "address": "321 Pine Street, Floor 2, San Francisco, CA, 94101, USA"
    },
    {
      "title": "Startup Pitch Competition",
      "hostedBy": "Innovate Inc.",
      "imgURL": "https://images.pexels.com/photos/1181395/pexels-photo-1181395.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "eventDes": "The Startup Pitch Competition is an exciting opportunity for aspiring entrepreneurs to showcase their innovative ideas to a panel of investors, mentors, and industry experts. Participants will have the chance to present their business concepts, receive constructive feedback, and potentially secure funding to bring their ideas to life. The event also features keynote speeches and panel discussions on topics such as fundraising, scaling startups, and navigating challenges in the entrepreneurial journey. This competition is not just about winning; it's about learning, networking, and gaining exposure in the startup ecosystem. Whether you're a startup founder, an investor, or someone passionate about entrepreneurship, the Startup Pitch Competition is an event you won't want to miss. Join us to witness groundbreaking ideas and be inspired by the creativity and determination of the next generation of entrepreneurs.",
      "dressCode": "Business formal",
      "ageRestrictions": "18 and above",
      "tags": ["startup", "business"],
    "startDateAndTime": "Sun Jun 29 2025 at 10:00:00 AM",
    "endDateAndTime": "Sun Jun 29 2025 at 12:00:00 PM",
      "entryPrice": 2000,
      "speakers": ["676bd2b8ec259f7a1a81e365"],
      "type":"Both",
      "address": "987 Cedar Drive, Building 5, Seattle, WA, 98101, USA"
    },
    {
        "title": "Green Energy Conference",
        "hostedBy": "EcoFuture",
        "imgURL": "https://images.pexels.com/photos/705792/pexels-photo-705792.jpeg?auto=compress&cs=tinysrgb&w=400",
        "eventDes": "The Green Energy Conference is a premier event dedicated to the advancement of sustainable energy solutions and environmental conservation. Join policymakers, researchers, and industry leaders as they discuss the latest innovations in renewable energy, carbon reduction strategies, and sustainable business practices. The conference will feature keynote speeches, panel discussions, and interactive sessions that delve into critical topics such as solar and wind energy, electric vehicles, and energy-efficient technologies. Attendees will have the opportunity to explore case studies, learn from successful green initiatives, and network with like-minded professionals who are passionate about creating a sustainable future. Whether you're an environmentalist, a business owner looking to adopt greener practices, or simply curious about the future of energy, this conference offers valuable insights and actionable takeaways.",
        "dressCode": "Business casual",
        "ageRestrictions": "18 and above",
        "tags": ["sustainability", "energy"],
    "startDateAndTime": "Fri May 30 2025 at 10:00:00 AM",
    "endDateAndTime": "Fri May 30 2025 at 12:00:00 PM",
        "entryPrice": 2500,
        "speakers": ["676beec2847e9c5816af045c", "676bee5f847e9c5816af045a"],
        "type":"Online",
        "address": "890 Spruce Terrace, Boston, MA, 02101, USA"
      },
      {
        "title": "Film Makers Workshop",
        "hostedBy": "Cinema Creatives",
        "imgURL": "https://images.pexels.com/photos/4270230/pexels-photo-4270230.jpeg?auto=compress&cs=tinysrgb&w=400",
        "eventDes": "Lights, camera, action! The Film Makers Workshop is a unique event designed for aspiring filmmakers, directors, and cinephiles looking to refine their craft and deepen their understanding of the art of cinema. This workshop includes hands-on sessions on scriptwriting, cinematography, directing, and editing, led by award-winning professionals in the film industry. Participants will learn the intricacies of storytelling, visual composition, and the technical aspects of filmmaking. Additionally, the workshop features panel discussions on trends in the industry, the impact of streaming platforms, and the challenges of independent filmmaking. Whether you're looking to produce your first short film, break into the industry, or simply expand your creative horizons, this workshop provides the tools, knowledge, and inspiration you need to succeed. Join us for an immersive experience that celebrates the magic of storytelling through film.",
        "dressCode": "Casual",
        "ageRestrictions": "16 and above",
        "tags": ["film", "creativity"],
    "startDateAndTime": "Wed Apr 30 2025 at 10:00:00 AM",
    "endDateAndTime": "Wed Apr 30 2025 at 12:00:00 PM",
        "entryPrice": 1500,
        "speakers": ["676bef79847e9c5816af0460"],
        "type":"Offline",
        "address": "987 Cedar Drive, Building 5, Seattle, WA, 98101, USA"
      },
      {
        "title": "Music and Arts Festival",
        "hostedBy": "Creative Vibes",
        "imgURL": "https://images.pexels.com/photos/2608097/pexels-photo-2608097.jpeg?auto=compress&cs=tinysrgb&w=400",
        "eventDes": "The Music and Arts Festival is a vibrant celebration of creativity, expression, and community. Bringing together talented musicians, visual artists, and performers, this festival is a sensory delight for art enthusiasts of all ages. Experience live concerts featuring diverse genres, from classical and jazz to rock and electronic, and explore art installations, workshops, and pop-up galleries. The event also includes interactive spaces where attendees can create their own artwork, learn musical instruments, or simply relax and enjoy the performances. With food trucks, craft stalls, and a family-friendly atmosphere, the Music and Arts Festival promises an unforgettable experience filled with joy, inspiration, and cultural enrichment. Join us for a day of music, art, and togetherness.",
        "dressCode": "Festival attire",
        "ageRestrictions": "All ages",
        "tags": ["music", "art"],
    "startDateAndTime": "Mon Mar 31 2025 at 10:00:00 AM",
    "endDateAndTime": "Mon Mar 31 2025 at 12:00:00 PM",
        "entryPrice": 1000,
        "speakers": ["676bef79847e9c5816af0460"],
        "type":"Offline",
        "address": "345 Redwood Court, Unit 15, Phoenix, AZ, 85001, USA"
      },
      {
        "title": "Global Leadership Summit",
        "hostedBy": "Leadership Hub",
        "imgURL": "https://images.pexels.com/photos/8761347/pexels-photo-8761347.jpeg?auto=compress&cs=tinysrgb&w=400",
        "eventDes": "The Global Leadership Summit is the ultimate event for professionals seeking to enhance their leadership skills, gain new perspectives, and connect with other like-minded individuals. Featuring keynote speakers from around the globe, the summit covers a range of topics including emotional intelligence, effective communication, team building, and navigating change in the workplace. The event also includes breakout sessions, networking opportunities, and panel discussions with top executives and thought leaders. Attendees will walk away with actionable strategies to inspire their teams, drive innovation, and lead with confidence in an ever-changing world. Whether you're a seasoned executive, a manager, or an aspiring leader, this summit offers the knowledge and tools to unlock your leadership potential.",
        "dressCode": "Business formal",
        "ageRestrictions": "18 and above",
        "tags": ["leadership", "career"],
    "startDateAndTime": "Sat Mar 01 2025 at 10:00:00 AM",
    "endDateAndTime": "Sat Mar 01 2025 at 12:00:00 PM",
        "entryPrice": 3000,
        "speakers": ["676bd2b8ec259f7a1a81e365"],
        "type":"Online",
        "address": "890 Spruce Terrace, Boston, MA, 02101, USA"
      }
  ]
  